SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_thread.c
/* ==================== PIPELINE ==================== */
int Capture_RequestSnapshot(uint32_t timeout_ms)
{
    uint32_t t_start = HAL_GetTick();
    CameraCmd_t cmd = {0}; cmd.type = CAM_CMD_SNAP;
    g_last_storage_rc = 0;
    while (xSemaphoreTake(storage_done_sem, 0) == pdTRUE) {
        /* Drain stale completion tokens from previous capture cycles. */
    }
    if (xQueueSend(camera_cmd_queue, &cmd, pdMS_TO_TICKS(100)) != pdTRUE) return -2;

    TickType_t ticks = (timeout_ms > 0) ? pdMS_TO_TICKS(timeout_ms) : portMAX_DELAY;
    if (xSemaphoreTake(camera_ready_sem, ticks) != pdTRUE) return -1;

#if WS2812_MODE == 1
    WS2812_FlashStop();
#elif WS2812_MODE == 0
    WS2812_FlashStop();
#endif

#if CAPTURE_MODE == 2 || CAPTURE_MODE == 4
    /* Wait for ALL BATCH_FRAMES to be stored before returning */
    int frames_to_wait = g_last_batch_frames > 0 ? g_last_batch_frames : BATCH_FRAMES;
    for (int i = 0; i < frames_to_wait; i++) {
        if (timeout_ms > 0) {
            uint32_t elapsed = HAL_GetTick() - t_start;
            if (elapsed >= timeout_ms) return -1;
            ticks = pdMS_TO_TICKS(timeout_ms - elapsed);
        } else { ticks = portMAX_DELAY; }
        if (xSemaphoreTake(storage_done_sem, ticks) != pdTRUE) return -1;
    }
#else
    if (timeout_ms > 0) {
        uint32_t elapsed = HAL_GetTick() - t_start;
        if (elapsed >= timeout_ms) return -1;
        ticks = pdMS_TO_TICKS(timeout_ms - elapsed);
    } else { ticks = portMAX_DELAY; }
    if (xSemaphoreTake(storage_done_sem, ticks) != pdTRUE) return -1;
#endif
    if (g_last_storage_rc != 0) return -1;
    return 0;
}
